Merge pull request #3 from pd241008/feature/docs
